First notebook file for the project

In [1]:
import pandas as pd
import numpy as np

In [4]:
#Absolute temperatures, monthly readings for Estonia
data_est=pd.read_csv("Estonia.csv")
data_est.head()

,Unnamed: 0,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,161268,1752-11-01,1.836,1.176,Estonia
1,161269,1752-12-01,-2.763,1.291,Estonia
2,161270,1753-01-01,-6.400,7.307,Estonia
3,161271,1753-02-01,-6.821,2.806,Estonia
4,161272,1753-03-01,-0.575,4.253,Estonia

In [6]:
data_emissions=pd.read_csv("emission data.csv")
data_emissions.head()

,Country,1751,1752,1753,1754,1755,1756,1757,1758,1759,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Afghanistan,0,0,0,0,0,0,0,0,0,...,8.515264e+07,9.191295e+07,1.003652e+08,1.125912e+08,1.233332e+08,1.333337e+08,1.431228e+08,1.532303e+08,1.654882e+08,1.785029e+08
1,Africa,0,0,0,0,0,0,0,0,0,...,3.183077e+10,3.301904e+10,3.421283e+10,3.541120e+10,3.664504e+10,3.789569e+10,3.918617e+10,4.047518e+10,4.178583e+10,4.311757e+10
2,Albania,0,0,0,0,0,0,0,0,0,...,2.287948e+08,2.331696e+08,2.377643e+08,2.430001e+08,2.479062e+08,2.529662e+08,2.586784e+08,2.646261e+08,2.708990e+08,2.772782e+08
3,Algeria,0,0,0,0,0,0,0,0,0,...,2.894820e+09,3.015005e+09,3.132819e+09,3.252626e+09,3.380736e+09,3.513171e+09,3.656348e+09,3.806940e+09,3.957319e+09,4.107870e+09
4,Americas (other),0,0,0,0,0,0,0,0,0,...,7.746025e+10,7.961787e+10,8.187178e+10,8.416656e+10,8.654197e+10,8.894874e+10,9.139192e+10,9.382747e+10,9.624253e+10,9.864116e+10

In [8]:
#Absolute temperatures monthly global readings
data_absolute=pd.read_csv("GlobalTemperatures.csv")
data_absolute.head()

,dt,LandAverageTemperature,LandAverageTemperatureUncertainty,LandMaxTemperature,LandMaxTemperatureUncertainty,LandMinTemperature,LandMinTemperatureUncertainty,LandAndOceanAverageTemperature,LandAndOceanAverageTemperatureUncertainty
0,1750-01-01,3.034,3.574,NaN,NaN,NaN,NaN,NaN,NaN
1,1750-02-01,3.083,3.702,NaN,NaN,NaN,NaN,NaN,NaN
2,1750-03-01,5.626,3.076,NaN,NaN,NaN,NaN,NaN,NaN
3,1750-04-01,8.490,2.451,NaN,NaN,NaN,NaN,NaN,NaN
4,1750-05-01,11.573,2.072,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
#Temperature variations - temperature readings like these correspond to how different the reading was when compared
#to global average for the years 1900-2000
#Annual readings
data_variations_annual=pd.read_csv("annual_csv.csv")
data_variations_annual.head()

    Source  Year    Mean
0     GCAG  2016  0.9363
1  GISTEMP  2016  0.9900
2     GCAG  2015  0.8998
3  GISTEMP  2015  0.8700
4     GCAG  2014  0.7408

In [13]:
#Monthly variations
data_variations_monthly=pd.read_csv("monthly_csv.csv")
data_variations_monthly.head()

    Source        Date    Mean
0     GCAG  2016-12-06  0.7895
1  GISTEMP  2016-12-06  0.8100
2     GCAG  2016-11-06  0.7504
3  GISTEMP  2016-11-06  0.9300
4     GCAG  2016-10-06  0.7292

In [30]:
#Data from NOAA, 1880-2019, monthly readings
data_variations_NOAA=pd.read_csv("data-NOAA.csv")
data_variations_NOAA.head()

     Year  Value
0  188001  -0.32
1  188002  -0.70
2  188003  -0.76
3  188004  -0.43
4  188005  -0.24